#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-REGADMIN.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PLR_REV/REG_ADMIN"]: Refreshing state... [id=moh_applications/client/c2d45ac3-fd76-4dfd-a309-034eb83f7555/scope-mappings/20e896f4-bf43-43ed-9441-d166e0513f34/eac35713-072d-4453-9ef1-084ea6e54eda]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-REGADMIN.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PLR_SIT/REG_ADMIN"]: Refreshing state... [id=moh_applications/client/c2d45ac3-fd76-4dfd-a309-034eb83f7555/scope-mappings/1197df69-9199-49a5-a49a-c7d43d35551c/2d61a029-76fa-4abc-a07d-b07caac5a438]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-QA-REGADMIN.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PLR_UAT/REG_ADMIN"]: Refreshing state... [id=moh_applications/client/c2d45ac3-fd76-4dfd-a309-034eb83f7555/scope-mappings/045f3224-9637-4785-a661-fc6f028804d2/620734a9-4036-47f9-8cf6-64e9698f004e]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.KEYCLOAK_TEST.module.moh_applications.module.DEMO-CLIENT.keycloak_openid_client.CLIENT will be created
  + resource "keycloak_openid_client" "CLIENT" {
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = true
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "DEMO-CLIENT"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + description                               = "Client for Herman demo"
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = false
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + name                                      = "DEMO-CLIENT"
      + oauth2_device_authorization_grant_enabled = false
      + pkce_code_challenge_method                = "S256"
      + realm_id                                  = "moh_applications"
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = false
      + standard_flow_enabled                     = true
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
      + valid_redirect_uris                       = [
          + "*",
        ]
      + web_origins                               = [
          + "+",
        ]
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.DEMO-CLIENT.keycloak_openid_user_attribute_protocol_mapper.bcsc_id will be created
  + resource "keycloak_openid_user_attribute_protocol_mapper" "bcsc_id" {
      + add_to_access_token  = true
      + add_to_id_token      = false
      + add_to_userinfo      = true
      + aggregate_attributes = false
      + claim_name           = "bcsc_id"
      + claim_value_type     = "String"
      + client_id            = (known after apply)
      + id                   = (known after apply)
      + multivalued          = false
      + name                 = "bcsc_id"
      + realm_id             = "moh_applications"
      + user_attribute       = "bcsc_guid"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.DEMO-CLIENT.keycloak_openid_user_attribute_protocol_mapper.common_provider_number will be created
  + resource "keycloak_openid_user_attribute_protocol_mapper" "common_provider_number" {
      + add_to_access_token  = true
      + add_to_id_token      = false
      + add_to_userinfo      = false
      + aggregate_attributes = false
      + claim_name           = "common_provider_number"
      + claim_value_type     = "String"
      + client_id            = (known after apply)
      + id                   = (known after apply)
      + multivalued          = false
      + name                 = "common_provider_number"
      + realm_id             = "moh_applications"
      + user_attribute       = "common_provider_number"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.DEMO-CLIENT.module.client-roles.keycloak_role.ROLES["Patient"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "Patient"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.DEMO-CLIENT.module.client-roles.keycloak_role.ROLES["Provider"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "Provider"
      + realm_id  = "moh_applications"
    }

Plan: 5 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @filipflorek, Action: `pull_request`*